app/Http/Controllers/Auth/RegisterController.php

select * from `roles` where `role_name` LIKE 'student' or `role_name` LIKE 'doctor'
---
    public function showRegistrationForm()
    {
        $roles=Role::where('role_name','LIKE','student')->orWhere('role_name','LIKE','doctor')->get();

select * from `roles` where `roles`.`id` = '2' limit 1
insert into `users` (`fname`, `mname`, `lname`, `username`, `mother_name`, `birth_date`, `birth_location`, `national_id`, `constraint`, `gender`, `address`, `phone`, `url`, `password`, `updated_at`, `created_at`) values ('dfg', 'gd', 'gsfd', 'fdg333', 'gsdf', '2023-07-14', 'fdsg', '32533', 'dfg', 0, 'gsdf', '43533', '123456.jpg', '$2y$10$x/4hcZo14WGb8nVSHwSInOfMrLyOFOqJ6DrWpZTVB1Gnq0xsp7mee', '2023-07-18 19:08:59', '2023-07-18 19:08:59')
insert into `role_user` (`role_id`, `user_id`) values ('2', 34)
---
    protected function create(array $data)
    {
        $role=Role::find($data['role_id']);

        if($role->role_name=='doctor')
            $this->redirectTo=RouteServiceProvider::DOCTOR_KEEP_REGISTER;

        $photoPath="123456.jpg";
        if(isset($data['url']))
            $photoPath=saveImage($data['url'],'images');

        $user=User::create([
            'fname' => $data['fname'],
            'mname' => $data['mname'],
            'lname' => $data['lname'],
            'username' => $data['username'],
            'mother_name' => $data['mother_name'],
            'birth_date' => $data['birth_date'],
            'birth_location' => $data['birth_location'],
            'national_id' => $data['national_id'],
            'constraint' => $data['constraint'],
            'gender' => $data['gender'],
            'address' => $data['address'],
            'phone' => $data['phone'],
            'url' => $photoPath,
            'password' => Hash::make($data['password']),
        ]);

        $roles=$data['role_id'];
        $user->roles()->attach($roles);