app/Http/Controllers/Auth/RegisterController.php

    public function showRegistrationForm()
    {
        $roles=Role::where('name','LIKE','student')->orWhere('name','LIKE','doctor')->get();
---
select * from `roles` where `name` LIKE 'student' or `name` LIKE 'doctor'